addpath(genpath('./m'))
data = [[1, 399.0, 130.7575757575753]
[2, 646.0, 130.7575757575753]
[3, 1059.0, 130.7575757575753]
[4, 1472.0, 130.7575757575753]
[5, 1692.0, 130.7575757575753]
[6, 2078.0, 130.75757575757518]
[7, 2491.0, 130.75757575757507]
[8, 2904.0, 130.75757575757507]
[9, 3316.0, 130.75757575757507]
[10, 3729.0, 130.75757575757507]];

x = data(:,1)
y = data(:,2)
epsilon = data(:,3)

X = [ x.^0, x ];
lb = [-inf 0];
irp_steam = ir_problem(X, y, epsilon, lb);

xp = [5; 7; 17.5; 22.5]
Xp = [xp.^0, xp];

yp = ir_predict(irp_steam, Xp)         # интервальный прогноз значений y в точках xp
ypmid = mean(yp,2)                     # средние значения прогнозных интервалов
yprad = 0.5 * (yp(:,2) - yp(:,1))      # радиус прогнозных интервалов

yprad_relative = 100 * yprad ./ ypmid  # относительная величина неопределенности прогнозов в процентах
